app/controllers/species_controller.rb

SELECT * FROM "species"
---
  def index
    respond_with(@species = Species.all)

SELECT * FROM "species" WHERE ("species"."id" = 1)
---
  def show
    respond_with(@species = Species.find(params[:id]))

INSERT INTO "species" ("created_at", "scientific_name", "updated_at") VALUES('2010-01-26 21:56:43', 'Test', '2010-01-26 21:56:43')
---
  def create
    @species = Species.create(params[:species])

SELECT * FROM "species" WHERE ("species"."id" = 1)
---
  def edit
    respond_with(@species = Species.find(params[:id]))

SELECT * FROM "species" WHERE ("species"."id" = 6)
UPDATE "species" SET "updated_at" = '2010-01-26 22:40:19', "scientific_name" = 'bbbcccTest species' WHERE "id" = 6
---
  def update
    @species = Species.find(params[:id])
    @species.update_attributes(params[:species])

SELECT * FROM "species" WHERE ("species"."id" = 6)
DELETE FROM "species" WHERE "id" = 6
---
  def destroy
    @species = Species.find(params[:id])
    @species.destroy